Revit 2026 API

# XYZMultiply(XYZ, Double) Operator

---

Multiplies the specified number and the specified vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static XYZ operator *(
	XYZ left,
	double value
)
```
```vb
Public Shared Operator * (
	left As XYZ,
	value As Double
) As XYZ
```
```cpp
public:
static XYZ^ operator *(
	XYZ^ left,
	double value
)
```
```fsharp
static let inline (*)
        left : XYZ *
        value : float  : XYZ
```

#### Parameters

left XYZ
    The vector to multiply with the value.
value Double
    The value to multiply with the specified vector.

#### Return Value

XYZThe multiplied vector.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |
| ArgumentException | Thrown when the specified value is an infinite number. |

The multiplied vector is obtained by multiplying each coordinate of the specified vector by the specified value.

#### Reference

XYZ Class

Multiply Overload

Autodesk.Revit.DB Namespace